МПР/src/InformationRegisters/ds_РезультатыОбменаДаннымиСОфисом/ds_РезультатыОбменаДаннымиСОфисом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ds_РезультатыОбменаДаннымиСОфисом</name>
  <resources>
    <name>ДатаВозникновения</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Причина</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Ссылка</name>
    <type>
      <types>DocumentRef</types>
      <types>CatalogRef</types>
    </type>
  </resources>
  <attributes>
    <name>СообщениеОбмена</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <dimensions>
    <name>УзелИнформационнойБазы</name>
    <type>
      <types>ExchangePlanRef.ds_ОбменСОфисом</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектМетаданных</name>
    <type>
      <types>CatalogRef.ИдентификаторыОбъектовРасширений</types>
      <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СсылкаНаОбъект</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

МПР/src/InformationRegisters/ds_РезультатыОбменаДаннымиСОфисом/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ds_РезультатыОбменаДаннымиСОфисом.СообщениеОбмена КАК СообщениеОбмена
	|ИЗ
	|	РегистрСведений.ds_РезультатыОбменаДаннымиСОфисом КАК ds_РезультатыОбменаДаннымиСОфисом
	|ГДЕ
	|	ds_РезультатыОбменаДаннымиСОфисом.УзелИнформационнойБазы = &УзелИнформационнойБазы
	|	И ds_РезультатыОбменаДаннымиСОфисом.ОбъектМетаданных = &ОбъектМетаданных
	|	И ds_РезультатыОбменаДаннымиСОфисом.СсылкаНаОбъект = &СсылкаНаОбъект"; 
	Запрос.УстановитьПараметр("УзелИнформационнойБазы", Запись.УзелИнформационнойБазы);
	Запрос.УстановитьПараметр("ОбъектМетаданных", Запись.ОбъектМетаданных);
	Запрос.УстановитьПараметр("СсылкаНаОбъект", Запись.СсылкаНаОбъект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
	    СообщениеОбмена = Выборка.СообщениеОбмена.Получить();

		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON, ЗначениеИзСтрокиВнутр(СообщениеОбмена));
		ТекстСообщенияОбмена = ЗаписьJSON.Закрыть();
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти
